# 实例035：设置输出颜色
# 题目：文本颜色设置。
# 程序分析：无。

class bcolors:
    HEADER = '\033[95m'
    OKBLUE = '\033[94m'
    OKGREEN = '\033[92m'
    WARNING = '\033[93m'
    FAIL = '\033[91m'
    ENDC = '\033[0m'
    BOLD = '\033[1m'
    UNDERLINE = '\033[4m'
print(bcolors.WARNING + "警告的颜色字体?" + bcolors.ENDC)

# 颜色写法：
# 开头部分：\033[显示方式；前景色；背景色m + 结尾部分：\033[0m
# 注意：开头部分的三个参数：显示方式、前景色、背景色是可选参数，但是必须要写一个。
# 由于三个参数不同含义的数值都是唯一的没有重复，所以参数的书写并没有顺序，系统都能够识别。

# 列举颜色
print('\033[30m黑色字体\033[0m')
print('\033[31m红色字体\033[0m')
print('\033[32m绿色字体\033[0m')
print('\033[33m黄色字体\033[0m')
print('\033[34m蓝色字体\033[0m')
print('\033[35m紫色字体\033[0m')
print('\033[36m青色字体\033[0m')
print('\033[37m白色字体\033[0m')
print('------------分割线----------------')
print('\033[40m黑色背景\033[0m')
print('\033[41m红色背景\033[0m')
print('\033[42m绿色背景\033[0m')
print('\033[43m黄色背景\033[0m')
print('\033[44m蓝色背景\033[0m')
print('\033[45m紫色背景\033[0m')
print('\033[46m青色背景\033[0m')
print('\033[47m白色背景\033[0m')